In [4]:
#Series versus 1-column DataFrame
import pandas as pd

In [5]:
df=pd.read_csv('sales.csv',index_col='month')

In [6]:
df

         huevos   sal  jamon
month
Enero        47  12.0   17.0
Febrero     110  50.0   31.0
Marzo       221  89.0   72.0
Abril        77  87.0   20.0
Mayo        132   NaN   52.0
Junio       205  60.0   55.0

In [7]:
df['huevos']

month
Enero       47
Febrero    110
Marzo      221
Abril       77
Mayo       132
Junio      205
Name: huevos, dtype: int64

In [8]:
type(df['huevos'])

pandas.core.series.Series

In [9]:
df[['huevos']]

         huevos
month
Enero        47
Febrero     110
Marzo       221
Abril        77
Mayo        132
Junio       205

In [10]:
type(df[['huevos']])

pandas.core.frame.DataFrame

# Filtering DataFrames

In [11]:
df.sal>60

month
Enero      False
Febrero    False
Marzo       True
Abril       True
Mayo       False
Junio      False
Name: sal, dtype: bool

In [12]:
#Filtering with a Boolean Series

In [13]:
df[df.sal>60]

       huevos   sal  jamon
month
Marzo     221  89.0   72.0
Abril      77  87.0   20.0

In [14]:
suficiente_sal_vendida=df.sal>60

In [15]:
suficiente_sal_vendida

month
Enero      False
Febrero    False
Marzo       True
Abril       True
Mayo       False
Junio      False
Name: sal, dtype: bool

In [16]:
df[suficiente_sal_vendida]

       huevos   sal  jamon
month
Marzo     221  89.0   72.0
Abril      77  87.0   20.0

In [17]:
#Combining filters

In [18]:
#filtre sal>50 y donde los datos de venta de huevos <200

In [19]:
df.sal>50

month
Enero      False
Febrero    False
Marzo       True
Abril       True
Mayo       False
Junio       True
Name: sal, dtype: bool

In [20]:
df.huevos<200

month
Enero       True
Febrero     True
Marzo      False
Abril       True
Mayo        True
Junio      False
Name: huevos, dtype: bool

In [21]:
df[(df.sal>50) & (df.huevos<200) ]

       huevos   sal  jamon
month
Abril      77  87.0   20.0

In [22]:
df[(df.sal>50) | (df.huevos<200) ]

         huevos   sal  jamon
month
Enero        47  12.0   17.0
Febrero     110  50.0   31.0
Marzo       221  89.0   72.0
Abril        77  87.0   20.0
Mayo        132   NaN   52.0
Junio       205  60.0   55.0

In [23]:
#DataFrames with zeros and NaNs

In [24]:
df2=df.copy()

In [26]:
df2

         huevos   sal  jamon
month
Enero        47  12.0   17.0
Febrero     110  50.0   31.0
Marzo       221  89.0   72.0
Abril        77  87.0   20.0
Mayo        132   NaN   52.0
Junio       205  60.0   55.0

In [27]:
df2['tocino']=[0,0,50,60,70,80]

In [28]:
df2

         huevos   sal  jamon  tocino
month
Enero        47  12.0   17.0       0
Febrero     110  50.0   31.0       0
Marzo       221  89.0   72.0      50
Abril        77  87.0   20.0      60
Mayo        132   NaN   52.0      70
Junio       205  60.0   55.0      80

In [29]:
#Select columns with all nonzeros

In [30]:
df2.loc[:,df2.all()]

         huevos   sal  jamon
month
Enero        47  12.0   17.0
Febrero     110  50.0   31.0
Marzo       221  89.0   72.0
Abril        77  87.0   20.0
Mayo        132   NaN   52.0
Junio       205  60.0   55.0

In [31]:
#Select columns with any nonzeros

In [32]:
df2.loc[:,df2.any()]

         huevos   sal  jamon  tocino
month
Enero        47  12.0   17.0       0
Febrero     110  50.0   31.0       0
Marzo       221  89.0   72.0      50
Abril        77  87.0   20.0      60
Mayo        132   NaN   52.0      70
Junio       205  60.0   55.0      80

In [33]:
#Select columns with any NaNs

In [34]:
df2.loc[:,df2.isnull().any()]

          sal
month
Enero    12.0
Febrero  50.0
Marzo    89.0
Abril    87.0
Mayo      NaN
Junio    60.0

In [35]:
#Select columns without NaNs

In [36]:
df2.loc[:,df2.notnull().all()]

         huevos  jamon  tocino
month
Enero        47   17.0       0
Febrero     110   31.0       0
Marzo       221   72.0      50
Abril        77   20.0      60
Mayo        132   52.0      70
Junio       205   55.0      80